[
  {
    "prompt_id": 1,
    "input_text": "It follows that for such a case to be inadmissible under Article 17(1)(a), the national investigation must cover the same individual and substantially the same conduct as alleged in the proceedings before the Court."
  },
  {
    "prompt_id": 2,
    "input_text": "The words 'is being investigated' signify taking steps directed at ascertaining whether those suspects are responsible for that conduct – for instance, interviewing witnesses or suspects, collecting documentary evidence, or carrying out forensic analyses. The mere preparedness to take such steps, or the investigation of other suspects, is not sufficient. Unless investigative steps are actually taken in relation to the suspects who are the subject of the ICC proceedings, it cannot be said that the same case is under investigation by both the Court and a national jurisdiction, and there is therefore no conflict of jurisdictions."
  },
  {
    "prompt_id": 3,
    "input_text": "In the Kenya cases, for example, Pre-Trial Chamber II deemed Kenya inactive with regard to William Ruto even though it submitted evidence that a case file had been opened and assigned a number, that the case file referred to Ruto as a suspect, and that the case file provided information about the scope of the investigation, including the location and time of Ruto’s alleged criminal conduct. Similarly, the PTC found Kenya inactive with regard to the other defendants even though Kenya’s evidence indicated that the Attorney General had formally ordered the Commissioner of Police to open investigations, and that investigators were locating potential witnesses, reviewing government documents and news reports, following up on leads, analyzing the actions of lower-level suspects to identify potential cooperating witnesses, and visiting various crime scenes."
  },
  {
    "prompt_id": 4,
    "input_text": "Côte d’Ivoire’s uncontested evidence indicated that the state had formally initiated an investigation of Simone Gbagbo, detained her, interrogated her, questioned a victim about her actions, and attempted to collect evidence relevant to her crimes. The Pre-Trial Chamber nevertheless concluded that Côte d’Ivoire was inactive regarding her case, because “the investigative activities undertaken by the domestic authorities are not tangible, concrete and progressive, but, on the contrary, sparse and disparate.”"
  },
  {
    "prompt_id": 5,
    "input_text": "In the Al-Senussi admissibility decision, the Pre-Trial Chamber adopted a flexible interpretation of “substantially the same conduct,” rejecting the Prosecutor’s view that a national investigation must focus on the same specific incidents as the ICC’s. In its view, a more holistic comparison of the respective investigations was required – one focusing on their temporal, geographic and material parameters (para. 75)."
  },
  {
    "prompt_id": 6,
    "input_text": "In the Gaddafi admissibility decision, the Pre-Trial Chamber found that, unlike in other cases, the incidents listed in the ICC’s warrant “do not represent unique manifestations of the form of criminality alleged” and thus constitute a non-exhaustive list of allegations. The Chamber thus opined that the suspect’s criminal conduct could be defined by illustrative examples, and that any incident investigated domestically may be relevant to the same conduct so long as it falls within the material scope of the crimes alleged in the ICC proceedings. Under this approach, a state may successfully challenge admissibility by investigating similar criminal acts without needing to show it is investigating the exact same incidents."
  },
  {
    "prompt_id": 7,
    "input_text": "“If, and perhaps most straightforwardly, the underlying incidents that the Prosecutor and the State are investigating are identical, the case will be inadmissible before the Court (subject to any finding of unwillingness or inability). At the other end of the scale, the Appeals Chamber finds it hard to envisage a situation in which the Prosecutor and a State can be said to be investigating the same case in circumstances in which they are not investigating any of the same underlying incidents. The real issue is, therefore, the degree of overlap required as between the incidents being investigated by the Prosecutor and those being investigated by a State, with the focus being upon whether the conduct is substantially the same. Again, this will depend upon the facts of the individual case.”"
  },
  {
    "prompt_id": 8,
    "input_text": "Libya argued that the Chamber should credit its stated intention to fully investigate Mr. Gaddafi, even if only limited investigative activity was underway. The Appeals Chamber dismissed such an approach, noting that it had already found in the Ruto Admissibility Judgment that the argument for allowing “some leeway” to permit a domestic investigation to proceed was unmeritorious."
  },
  {
    "prompt_id": 9,
    "input_text": "“As argued by Libya and the Prosecutor, there is no requirement in the Statute for a crime to be prosecuted as an international crime domestically. This is because, in line with the Appeals Chamber’s prior jurisprudence on what constitutes the same case, what is required is that the crimes prosecuted at the domestic level cover ‘substantially the same conduct’ as those charged by the Court. In determining whether they do, the Pre-Trial Chamber must assess whether the domestic case sufficiently mirrors the case before the Court. As Libya and the Prosecutor both argue, it is the alleged conduct, as opposed to its legal characterisation, that matters.”"
  },
  {
    "prompt_id": 10,
    "input_text": "The Pre-Trial Chamber ruled that, under Article 17, “the assessment of domestic proceedings should focus on the alleged conduct and not its legal characterisation,” and that the fact domestic investigations are carried out “with a view to prosecuting international crimes is not determinative” (Decision on the Gaddafi and Al‑Senussi admissibility challenges, para. 85). In reaching this conclusion, the Chamber noted that neither the complementarity provisions nor the related ne bis in idem principle imposes any obligation on a State to adopt the same legal characterisation of the conduct."
  },
  {
    "prompt_id": 11,
    "input_text": "Pre-Trial Chamber I in Lubanga observed that “the self-referral of the DRC appears consistent with the ultimate purpose of the complementarity regime.”"
  },
  {
    "prompt_id": 12,
    "input_text": "“However, if a State considers that it is more opportune for the Court to carry out an investigation or prosecution, that State will still be complying with its duties under the complementarity regime if it surrenders the suspect to the Court in good time and cooperates fully with the Court in accordance with Part IX of the Statute. […] The Chamber is not in a position to ascertain the real motives of a State which expresses its unwillingness to prosecute a particular case. A State may, without breaching the complementarity principle, refer a situation concerning its territory to the Court if it considers it opportune to do so, just as it may decide to carry out an investigation or prosecution of a particular case.”"
  },
  {
    "prompt_id": 13,
    "input_text": "The Appeals Chamber in the Katanga case confirmed that “the Statute does not prevent a State from relinquishing its jurisdiction in favour of the Court.”"
  },
  {
    "prompt_id": 14,
    "input_text": "As John T. Holmes observes, the point of the unwillingness criterion is “to preclude the possibility of sham trials aimed at shielding perpetrators” from accountability."
  },
  {
    "prompt_id": 15,
    "input_text": "It is important to emphasize that a State cannot be deemed “unwilling” simply because it charges a suspect with an ordinary domestic crime instead of an international crime. In other words, a state can charge a suspect with murder (a domestic offense) instead of the war crime of murder and still be considered genuinely willing to prosecute him."
  },
  {
    "prompt_id": 16,
    "input_text": "In an admissibility challenge by Kenya, the Chamber held that the State “must provide the Court with evidence with a sufficient degree of specificity and probative value that demonstrates that it is indeed investigating the case.” It emphasized that it is not sufficient for a State merely to assert that investigations are ongoing. The burden of proof rests with the party challenging admissibility."
  },
  {
    "prompt_id": 17,
    "input_text": "In the Gaddafi admissibility appeal, the Appeals Chamber declined to disturb the Pre-Trial Chamber’s factual and legal findings absent clear error. It noted that Libya had failed to show any error of law or any unreasonableness in the Pre-Trial Chamber’s conclusion that Libya was not investigating the same case. The Appeals Chamber also found no fault with the Pre-Trial Chamber’s determination that the “unavailability” of Libya’s judicial system prevented it from obtaining custody of the suspect and necessary evidence – a situation that rendered Libya unable to carry out the proceedings, and thus left the case admissible before the ICC."
  },
  {
    "prompt_id": 18,
    "input_text": "The unwillingness inquiry examines the State’s subjective motivation. Essentially, it asks whether the State genuinely intends to bring the suspect to justice, or whether it is simply trying to shield the suspect by taking the case out of the ICC’s hands."
  },
  {
    "prompt_id": 19,
    "input_text": "Inability, by contrast, is an objective question. The Court simply asks whether the State challenging admissibility has a functioning justice system and the capacity to obtain both the suspect and the evidence needed to convict him. If not – for example, if the suspect is held in another country that refuses extradition – the State’s challenge will fail and the ICC’s investigation can proceed. (Notably, the ICC can proceed even if it itself might have trouble obtaining the suspect; the “ability” requirement applies to the State, not to the Prosecutor.)"
  },
  {
    "prompt_id": 20,
    "input_text": "The Pre-Trial Chamber found that the “unavailability of [Libya’s] national judicial system” prevented Libya from “obtaining the accused” and securing “the necessary evidence” to carry out proceedings against Mr. Gaddafi. The Appeals Chamber held that the Pre-Trial Chamber made no error in this conclusion."
  },
  {
    "prompt_id": 21,
    "input_text": "Judge Song, in a separate opinion, agreed that Libya’s investigation covered the same case as the ICC’s, but concluded that the case was nevertheless admissible because Libya could not secure custody of Mr. Gaddafi."
  },
  {
    "prompt_id": 22,
    "input_text": "Judge Ušacka dissented, arguing that the “same person/same conduct” test set by the majority was not consistent with the complementarity requirement in Article 17. In her view, such a rigid test interferes with national sovereignty and prevents States from focusing on broader aspects of a situation. The goal of fighting impunity, she contended, can also be achieved if different crimes (not exactly the same as those before the ICC) are being investigated nationally."
  },
  {
    "prompt_id": 23,
    "input_text": "Complementarity involves a two-step analysis. First, the Court asks whether the case is being investigated or prosecuted by a State with jurisdiction. If the State is inactive (not investigating or prosecuting the case), the analysis ends there and the ICC may proceed. If the State is active, however, the ICC must defer to the national proceedings unless the State is unwilling or unable genuinely to carry them out."
  },
  {
    "prompt_id": 24,
    "input_text": "The “same person” element of complementarity is straightforward: if the ICC has issued an arrest warrant for General X, then X’s case remains admissible before the ICC unless the national authorities are actually investigating General X. It does not matter that the State is investigating other suspects (Generals W, Y, and Z), nor that it plans eventually to investigate X, nor that it is investigating lower-level offenders in hopes of building a case against X. None of those scenarios satisfies the same-person test."
  },
  {
    "prompt_id": 25,
    "input_text": "The Appeals Chamber has made clear that States must do more than nibble at the edges of the ICC’s case. National proceedings are assessed based on what incidents the State is investigating at the time of the admissibility challenge, without credit for mere promises to expand the investigation in the future."
  },
  {
    "prompt_id": 26,
    "input_text": "The ICC is intended to be a court of last resort. The Rome Statute’s framework rests on the idea that national courts should address serious international crimes first and foremost, and that the ICC will only intervene in very limited circumstances – essentially, when States are unable or unwilling to do so genuinely."
  },
  {
    "prompt_id": 27,
    "input_text": "If a State with jurisdiction over a case is not investigating or prosecuting it at all – in other words, if it is completely inactive – then the case is admissible by default before the ICC. In such a scenario, the complementarity analysis need not even reach questions of unwillingness or inability; the lack of any national action suffices to allow ICC intervention."
  },
  {
    "prompt_id": 28,
    "input_text": "Under Article 17(1)(b), a case is inadmissible if the State has investigated it and decided not to prosecute the person – unless that decision resulted from the State’s unwillingness or inability to prosecute genuinely. In other words, a good-faith decision not to prosecute after a proper investigation will bar the ICC, but a decision motivated by shielding the suspect (or reflecting an inability to prosecute) will not."
  },
  {
    "prompt_id": 29,
    "input_text": "Article 17(2) provides that the Court, in assessing unwillingness, shall consider whether one or more of the following exist: (a) the proceedings were or are being undertaken (or the national decision was made) for the purpose of shielding the person concerned from criminal responsibility for ICC crimes; (b) there has been an unjustified delay in the proceedings inconsistent with an intent to bring the person to justice; or (c) the proceedings were not or are not being conducted independently or impartially, and are being conducted in a manner inconsistent with an intent to bring the person to justice."
  },
  {
    "prompt_id": 30,
    "input_text": "Article 17(3) defines inability. The Court considers whether, due to a total or substantial collapse or unavailability of the national judicial system, the State is unable to obtain the accused or the necessary evidence and testimony or otherwise unable to carry out its proceedings. In short, a State’s inability to secure the accused, evidence, or otherwise conduct proceedings (for example, because of a breakdown of its courts) will render the case admissible at the ICC."
  },
  {
    "prompt_id": 31,
    "input_text": "Article 20(3) of the Statute (reflected in Article 17(1)(c)) prohibits the ICC from trying a person who has already been tried in a national court for the same conduct, unless the national proceedings were for the purpose of shielding the person from criminal responsibility or were not conducted independently or impartially. In practice, this means that a prior genuine national trial (leading to conviction or acquittal) bars ICC prosecution of the same conduct, but a sham or compromised national trial does not."
  },
  {
    "prompt_id": 32,
    "input_text": "All that matters is whether Israel is willing and able to investigate the specific suspects wanted by the ICC and is actively conducting those investigations when it invokes complementarity."
  },
  {
    "prompt_id": 33,
    "input_text": "ICC jurisprudence has consistently applied the 'same person/same conduct' test when assessing admissibility. In practice, national authorities must be dealing with the same individual and substantially the same underlying conduct as the ICC case in order to render that case inadmissible."
  },
  {
    "prompt_id": 34,
    "input_text": "Unlike the ad hoc tribunals, which had primacy, the ICC operates on a system of complementary jurisdiction. Had the ICC been given primary jurisdiction, it could have taken over cases even when national authorities were pursuing them. Instead, States at Rome insisted on retaining their sovereign right to prosecute – the ICC would come into play only if national jurisdictions failed to act genuinely."
  },
  {
    "prompt_id": 35,
    "input_text": "Article 18 of the Statute allows a State to request a deferral of the ICC’s investigation at the situation stage. When the Prosecutor initiates an investigation, he must notify all States concerned. Any State with jurisdiction may, within one month, inform the Court that it is investigating or has investigated its nationals or others for the crimes at issue. If such a notification is made, the Prosecutor must defer to the State’s investigation unless and until the Pre-Trial Chamber finds that the national proceedings do not satisfy the complementarity requirements."
  },
  {
    "prompt_id": 36,
    "input_text": "An admissibility assessment under Article 18 is necessarily broader than under Article 19. At the preliminary stage, specific cases may not yet be clearly defined. As the Appeals Chamber observed, “the contours of the likely cases will often be relatively vague because the investigations of the Prosecutor are at their initial stages” (Kenyatta Admissibility Appeal Judgment, para. 84). In other words, under Article 18 the ICC compares the State’s overall investigative steps in the situation with the Prosecutor’s initial inquiry, rather than a one-to-one case comparison."
  },
  {
    "prompt_id": 37,
    "input_text": "Article 19 governs challenges to the admissibility of specific cases. A State or an accused can challenge admissibility, but generally only once and at the earliest opportunity. A State must raise a complementarity challenge as soon as possible – typically after an arrest warrant is issued, when the potential case is clearer. If a State does challenge a case’s admissibility, the Prosecutor must suspend the ICC investigation until the Court decides the matter (Article 19(7)); however, if only a suspect challenges admissibility, the Prosecutor need not suspend proceedings unless the Court rules in the suspect’s favor."
  },
  {
    "prompt_id": 38,
    "input_text": "Even when the ICC has jurisdiction, a UN Security Council referral does not override complementarity. The principle applies regardless of how the Court is seised of a situation. In other words, even for situations referred by the Security Council, the ICC may only exercise jurisdiction if national authorities are unwilling or unable genuinely to prosecute – the primary responsibility still lies with States."
  },
  {
    "prompt_id": 39,
    "input_text": "The Prosecutor or the Court can raise admissibility on their own initiative. Article 19(1) and (3) permit the Court to consider admissibility even in the absence of a State or defense challenge. This means the ICC can, at any stage, satisfy itself that a case is admissible – or decline to proceed with a case – if complementarity so requires, ensuring that the ICC does not encroach on genuine national proceedings."
  },
  {
    "prompt_id": 40,
    "input_text": "If a case has been found inadmissible due to ongoing national proceedings, the Statute allows for reconsideration. Under Article 19(10), the Prosecutor may request that the Court revisit a finding of inadmissibility if new facts arise showing that the conditions have changed. For example, if a state that was handling a case genuinely later stops or conducts proceedings in bad faith, the ICC could potentially re-open the admissibility question."
  },
  {
    "prompt_id": 41,
    "input_text": "For admissibility under Article 18 (which deals with deferral of an investigation), the ICC has indicated that a State must demonstrate an ongoing, advancing process of domestic investigations or prosecutions related to the same groups of suspects and crimes. The analysis under Article 18 accounts for the broader context – unlike a specific case challenge, it compares the State’s general investigative efforts in the situation with the Prosecutor’s preliminary investigation of that situation."
  },
  {
    "prompt_id": 42,
    "input_text": "Complementarity is evaluated case by case. A State might prosecute some perpetrators of a situation’s crimes (making those cases inadmissible before the ICC), while not addressing others. The ICC can proceed against suspects whom the State is not genuinely pursuing, even if the State is handling different suspects or lesser crimes arising from the same situation. Complementarity does not bar the ICC from acting simply because a State is active in the situation; it bars the ICC only from proceeding against a suspect when that same case is being handled nationally."
  },
  {
    "prompt_id": 43,
    "input_text": "The complementarity regime is often seen as encouraging national prosecutions. By stepping in only when States fail to act, the ICC creates an incentive for States to fulfill their duty to prosecute serious crimes themselves. This approach – sometimes called “positive complementarity” – means the ICC can catalyze domestic justice efforts, using the threat of ICC intervention to spur States to take genuine action against perpetrators."
  },
  {
    "prompt_id": 44,
    "input_text": "“Complementarity” ultimately protects sovereign interests in pursuing justice. As one commentator explains, the principle’s purpose is “to protect sovereign interests in the pursuit of justice for crimes within the Court’s jurisdiction.” Accordingly, the ICC must refrain from proceeding with a case whenever the criteria of Article 17 are satisfied – in essence, respecting the primacy of genuine national proceedings."
  },
  {
    "prompt_id": 45,
    "input_text": "In the Kenya admissibility proceedings, the ICC determined that Kenya was not genuinely investigating the same case. The government had set up investigative bodies and claimed to be examining post-election violence, but the Court found no concrete steps were being taken against the specific suspects for the same conduct at issue. Consequently, in 2011 the ICC ruled that the cases remained admissible, as Kenya’s proceedings were insufficient to displace the Court’s jurisdiction."
  },
  {
    "prompt_id": 46,
    "input_text": "By contrast, in the case of Abdullah Al-Senussi, the ICC accepted Libya’s admissibility challenge. The Pre-Trial Chamber found that Libya’s domestic investigation and prosecution of Al-Senussi covered the same alleged conduct as the ICC’s case, and it saw no evidence of unwillingness or inability. The Chamber therefore held that Al-Senussi’s case was inadmissible before the ICC, allowing Libya’s national proceedings to go forward."
  },
  {
    "prompt_id": 47,
    "input_text": "Complementarity does not require that national proceedings mirror the ICC’s charges in severity or labeling. The ICC does not second-guess the adequacy of national sentences or the classification of offenses, as long as the national proceedings were genuine. A conviction for ordinary crimes or a relatively lenient sentence will satisfy complementarity – the ICC’s concern is only with whether the proceedings were conducted in good faith, not with substituting its judgment on the appropriate charge or punishment."
  },
  {
    "prompt_id": 48,
    "input_text": "Article 17(1)(d) adds the requirement that a case be of sufficient gravity to justify further action by the Court. This gravity threshold is a separate admissibility filter: even if no State is prosecuting, the ICC will decline to proceed with cases that are considered of marginal seriousness. In practice, the Office of the Prosecutor has used this criterion to screen out cases involving few victims or low-level perpetrators, ensuring that the ICC devotes its resources to the most grave situations."
  },
  {
    "prompt_id": 49,
    "input_text": "Complementarity and the ne bis in idem principle mean that the ICC will not re-try a suspect who has been genuinely tried by a national court. Even an acquittal or a decision not to charge, if reached in good faith, will bar the ICC from proceeding against the person for the same conduct. The ICC is not an appeals court to review national verdicts – its mandate is to step in only if the national process was a sham or otherwise deficient under Article 17’s criteria."
  },
  {
    "prompt_id": 50,
    "input_text": "Once an ICC trial has begun, it is very difficult for a State to reclaim jurisdiction over the case. In the Katanga case, the defendant argued that new domestic proceedings in the DRC made his ICC trial inadmissible. The ICC rejected this late challenge, emphasizing that Article 19(4) generally allows only one admissibility challenge before or at the start of trial (absent exceptional circumstances). In other words, a State cannot readily demand the return of a case to its national system once the ICC’s trial is underway."
  },
  {
    "prompt_id": 51,
    "input_text": "Article 12(2)(a) implies an autonomous, objective determination of whether the territorial precondition to the exercise of the Court's jurisdiction is satisfied. That accession to the Statute by a State Party (or a valid declaration under Article 12(3)) as a necessary precondition to the exercise of jurisdiction under Article 12(2)(a) cannot be conflated with the position that accession is a sufficient condition for the exercise of jurisdiction under it. The plain text of Article 12(2)(a) requires more than simply acceptance of jurisdiction: (i) there must be a 'State' (through which the exercise of jurisdiction is preconditioned); (ii) the 'State' has 'accepted' the Court's jurisdiction over Article 5 crimes; and (iii) the 'State' possesses the 'territory' on which there is a reasonable basis to believe that Article 5 conduct has occurred. The Chamber is simply requested to examine whether the preconditions to the exercise of the Court's jurisdiction under Article 12 are met. The territorial precondition to the exercise of jurisdiction under Article 12(2)(a) does not relate to the rights and obligations of a State Party; it refers to the preconditions that must be satisfied for the Court to exercise jurisdiction. It is an objective, legal, determination of a jurisdictional question."
  },
  {
    "prompt_id": 52,
    "input_text": "Article 19 expressly permits jurisdictional challenges (as opposed to admissibility challenges) to be brought in relation to a Situation as a whole, and not only in relation to 'a case'. OHCHR Hence, the title of Article 19 is 'challenges to the jurisdiction of the Court or to the admissibility of a case'. The distinction is repeated in the chapeau language of Article 19(2): 'challenges to the admissibility of a case [...] or challenges to the jurisdiction of the Court may be made by [...]'. The use of the conjunction 'or' suggests that the word 'case' applies only to admissibility proceedings and not to those concerning jurisdiction. This accords with the Court's jurisdictional design. The Rome Statute, unlike the constitutive instruments of other ad hoc international criminal tribunals, does not establish the precise temporal or territorial parameters of all potential situations. International Criminal Court Rather, articles 11 to 14 set out the jurisdictional requirements for all situations, and the Court must ultimately define the jurisdictional scope of its activities within a given situation. Moreover, while 'admissibility is an ambulatory process' and complementarity assessments might vary, the territorial scope of the Court's jurisdiction within any given situation is generally static."
  },
  {
    "prompt_id": 53,
    "input_text": "The Appeals Chamber interpreted article 17(1)(a) and (b) to require a two-part test. The first part assesses whether or not there are 'ongoing investigations or prosecutions, or...whether there have been investigations in the past, and the State having jurisdictions has decided not to prosecute the person concerned. It is only when the answers to these questions are in the affirmative that one has to...examine the question of unwillingness and inability.' Oxford Public International Law International Center for Transitional Justice The complementarity principle, as enshrined in the Statute, strikes a balance between safeguarding the primacy of domestic jurisdictions to investigate and prosecute those most responsible for Rome Statute crimes and the goal of the Rome Statute to 'put an end to impunity' for the perpetrators of the most serious crimes of international concern. Under the fifth ground of appeal, the Defence for Mr Katanga disputed the fact that a State can decide whether or not it is willing to prosecute international crimes 'without the need to justify or explain its unwillingness'. However, the Appeals Chamber considered that this argument is misconceived, and held that whether or not a case is admissible is determined by the Court, which assesses the relevant facts against the criteria of article 17 of the Statute."
  },
  {
    "prompt_id": 54,
    "input_text": "For any of the ne bis in idem rules in Article 20 of the Rome Statute to apply, four cumulative conditions must be fulfilled: that a person presently faces the prospect of trial by a court, that the person already have been tried by another court, that this prior trial has resulted in a final decision, and that the new trial concerns the same matter. Routledge Cairn Article 20(1) embodies the intra-jurisdictional aspect of the ne bis in idem principle, as it applies within the ICC itself, barring retrial of persons already tried by the ICC. Michaelgkarnavas The triggering of the principle relies on these conditions and the termination of the case before without a conviction or acquittal would have the opposite effect. Article 20(3) is concerned with the inter-jurisdictional rule which bars the ICC from trying a person, with respect to the same conduct, who has already been tried by another court for conduct also proscribed under Articles 6, 7, 8, or 8 bis of the Rome Statute. Cairn This provision also provides the exceptions to the ne bis in idem rule which permit an ICC trial if the prior domestic proceedings were for the purpose of shielding the person from criminal responsibility or were not conducted independently or impartially in accordance with due process norms and were inconsistent with an intent to bring the person to justice."
  },
  {
    "prompt_id": 55,
    "input_text": "To interpret the phrase under consideration, it is necessary to draw out two sides to the complementarity principle. On one side, it is firmly rooted in state sovereignty — it affirms states' primary role in exercising criminal jurisdiction over international crimes. Oxford Academic This much is uncontroversial. Here, though, we should be careful not to frame that underlying sovereignty as purely antagonistic to the role of the Court and international criminal law more broadly. But in another sense, it is richer than that, in that it is (or should be) informed by recognition of the limitations of the ICC itself, both its design and operation, and of the difficulties inherent in the entire project of establishing a single institution that prosecutes crimes committed across the world. In this respect, it is worth highlighting two related difficulties — the disconnection between the Court and the (actual) communities in which the crimes occur and the Court's ongoing struggles with legitimacy in the cases it is able to prosecute."
  },
  {
    "prompt_id": 56,
    "input_text": "The interpretation of Article 17(1)(a) proposed in this article is more consistent with both sides of the principle than an interpretation that limits it to prosecutions in the state's own domestic courts. As to the first side of the principle, the sovereignty of the state, the interpretation proposed herein recognizes that the state may choose to exercise its jurisdiction by the delegation of powers to a regional tribunal. This choice is an exercise of state sovereignty. oup As to the second side of the principle, the role of the Court as one of last resort, there is the simple point that if a regional tribunal is genuinely exercising jurisdiction, there is no impunity gap. In addition, the interpretation proposed herein recognizes that regional tribunals may be better placed to realize many of the values that underpin complementarity — that is, its richer content."
  },
  {
    "prompt_id": 57,
    "input_text": "The design of the ne bis in idem principle in the ICC statute is highly protective of State prosecutions and is expressly different from the statutes for the International Criminal Tribunal for the former Yugoslavia (ICTY) and the International Criminal Tribunal for Rwanda (ICTR) that permit greater control by the international tribunal than exists with the ICC. The definitions chosen for ne bis in idem in the ICC statute foster the priority of States in initially prosecuting crimes, give states great leeway to prosecute after an ICC prosecution, and greatly limit the ability of the ICC to prosecute after a state adjudication of the facts. SSRN Santa Clara University Although the application of the ne bis in idem provision is not settled since the ICC has yet to interpret it, a broad interpretation of ne bis in idem that favors state prosecutions over ICC prosecutions would be more consistent with the language of the statute and the underlying principle of complementarity."
  },
  {
    "prompt_id": 58,
    "input_text": "The most accurate interpretation of the ICC statutory provisions would provide for a broad ne bis in idem prohibition when a national prosecution is followed by a potential ICC prosecution, blocking a subsequent ICC prosecution based on the same conduct. SSRN Santa Clara University The conclusion is reached that, barring evasive, deceptive practices, it is unlikely that the exceptions would change the result that most national prosecutions would bar subsequent ICC prosecutions for the same conduct. Santa Clara University SSRN This State-protective approach of the ICC statute may result in multiple prosecutions for the same conduct, while the deferential approach will potentially preempt ICC jurisdiction in cases in which one might argue that an international prosecution based on more serious crimes would result in greater justice."
  },
  {
    "prompt_id": 59,
    "input_text": "The admissibility challenges of Libya in the cases of Saif Al-Islam Gaddafi and Abdullah Al-Senussi illustrate the realities of reconciling immediate global justice with the imperatives of local justice following mass atrocity. Striking the right balance between time and justice is at the root of an effective system of complementarity. The Libya cases provide an important precedent because it presents a post-conflict situation with actual national proceedings and a genuine willingness to prosecute. Oxford Academic As such, it addresses the extent to which the ICC should accommodate the time and resource constraints of national judicial systems in transitional situations. Instead of a rush to judgment, making the complementarity principle a practical reality requires meaningful engagement with the messy realities of post-conflict justice."
  },
  {
    "prompt_id": 60,
    "input_text": "The Rome Statute curtails sovereign authority by displacing domestic trials only in exceptional circumstances, and it includes detailed procedural guidance designed to balance sovereign enforcement against unreasonable extensions of ICC prosecutorial power. In theory, complementarity is an impartial, reliable, and de-politicized process for identifying the cases of international concern, and hence supranational jurisdiction. Vanderbilt Law School If complementarity becomes the vehicle for overriding the discretion of domestic officials and displacing their authority based on the preferences of the ICC Prosecutor of Pre-Trial Chambers, the original function of the complementarity principle will have been eviscerated. An ICC that routinely overrides the good faith reasoning of domestic officials would inevitably face a crisis of confidence and cooperation."
  },
  {
    "prompt_id": 61,
    "input_text": "Article 54(1) encompasses the notion of evidence-led, rather than target-driven, investigations; it is the facts and evidence that must serve as the impetus for the investigation and prosecution of those individuals most responsible for Rome Statute crimes, regardless of their nationality, religion or political affiliation. Nowhere do the legal texts of the Court offer the Prosecution the escape route of refusing to extend an investigation to cover all facts and evidence for reasons of resource constraints. Opinio Juris Prosecutorial discretion is not unfettered. It must be exercised within the limits of the law, including Article 54(1), and with the Court's purpose to end impunity in mind. Hence, while the Prosecutor has discretion to independently determine what cases to pursue and individuals to prosecute having impartially collected all relevant evidence, the Statute denies the Prosecutor the power to limit the investigation to facts and evidence relevant to the potential liability of persons belonging to pre-determined, demarcated entities."
  },
  {
    "prompt_id": 62,
    "input_text": "The Appeals Chamber defined what it means for a state to be active with regard to a case in the Kenya Appeal Judgment. The defining elements of a concrete case before the Court are the individual and the alleged conduct. It follows that for such a case to be inadmissible under article 17 (1) (a) of the Statute, the national investigation must cover the same individual and substantially the same conduct as alleged in the proceedings before the Court. The 'same person' aspect of the activity test is straightforward in terms of the suspect's identity. If the ICC has issued an arrest warrant for General X, General X's case is admissible — can be pursued by the OTP — unless the state invoking complementarity is investigating General X. Full stop. It doesn't matter that the state is investigating Generals W, Y, and Z. It doesn't matter that the state is planning to eventually investigate General X."
  },
  {
    "prompt_id": 63,
    "input_text": "The Chamber reaffirmed that article 17(1)(c) together with article 20(3) of the Rome Statute provide that a second trial for the 'same conduct' is not permitted unless 'the proceedings in the other court were tainted with irregularities'. For this purpose, the decision on a conviction or acquittal should be final, meaning that the judgement has acquired the res judicata effect. Coalition for the International Criminal Court In analyzing whether the judgement of the Tripoli Criminal Court was final, the Chamber took into consideration that it was decided in first instance and, in principle, should still be subject to appeal before the Libyan Court of Cassation. Additionally, the judgement was rendered in absentia. According to Libyan national law, in cases of absentia, a new trial should start once the person is arrested. For these reasons, the Pre-Trial Chamber concluded that the judgement was not a final decision on the merits. Coalition for the International Criminal Court Therefore, it was not sufficient for satisfying articles 17(1)(c) and 20(3) of the Rome Statute."
  },
  {
    "prompt_id": 64,
    "input_text": "Unwillingness is defined by Art. 17(2) of the Rome Statute. OHCHR This is an inquiry into the subjective motivations of the state challenging the admissibility of a case, one that essentially ask the PTC to determine whether the state genuinely wants to convict the suspect it is investigating — or simply wants to protect the suspect by taking the case away from the ICC. The point of the unwillingness criterion is 'to preclude the possibility of sham trials aimed at shielding perpetrators' from conviction. It is important to emphasise that a state cannot be considered unwilling simply because it charges a suspect with an 'ordinary' domestic crime instead of an international crime. In other words, a state can charge a suspect with murder instead of the war crime of murder and still be considered willing to genuinely prosecute him."
  },
  {
    "prompt_id": 65,
    "input_text": "The Prosecutor and the Pre-Trial Chambers of the International Criminal Court (ICC) have created a mechanical template for addressing admissibility determinations in the early phases of litigation that torques the institutional centre of gravity far from its intended purpose. The structure of the Rome Statute requires that ICC prosecutorial discretion should dovetail with good-faith domestic authority in a synergistic but respectful manner. Current jurisprudential trends empower the International Criminal Court (ICC) Prosecutor to override domestic investigative authorities in a manner that violates the letter and spirit of the Rome Statute. No provision of the Rome Statute permits the Office of the Prosecutor (OTP) to substitute its unfettered judgment over the good-faith discretion of domestic prosecutors."
  },
  {
    "prompt_id": 66,
    "input_text": "In Al-Senussi, the PTC adopted a quite flexible interpretation of 'substantially the same conduct,' rejecting the Prosecutor's insistence that a national investigation must focus on substantially the same incidents as the OTP in order to satisfy the requirement. In Gaddafi, however, the Appeals Chamber rejected holistic comparison, insisting that the comparison had to be incident based. If the underlying incidents that the Prosecutor and the State are investigating are identical, the case will be inadmissible before the Court. The real issue is, therefore, the degree of overlap required as between the incidents being investigated by the Prosecutor and those being investigated by a State with the focus being upon whether the conduct is substantially the same. PTCs must judge the extent of mirroring on what incidents the state is investigating at the time of the complementarity challenge, disregarding any promises by the state to expand the incidents under investigation over time."
  },
  {
    "prompt_id": 67,
    "input_text": "Article 19 is straightforward. A state or suspect can challenge the admissibility of a case once — but only once. OHCHR A suspect can challenge admissibility once an arrest warrant for him or her has been issued. A state that is investigating the case (or has investigated it and declined to prosecute) can challenge admissibility but must do so at the earliest opportunity. That will normally be after an arrest warrant has been issued, because that is when the state will have the clearest sense of what incidents the OTP is investigating, the PTC's comparator for the national investigation. When a state challenges admissibility, the OTP has to suspend its investigation unless and until the PTC rejects the state's challenge."
  },
  {
    "prompt_id": 68,
    "input_text": "International human rights law requires that an investigation be adequate, prompt, and thorough to be effective. The European Court of Human Rights has clarified that to be adequate, 'the authorities must take whatever reasonable steps they can to secure the evidence concerning the incident'. One may infer from this that international human rights law requires that the Prosecutor, as the investigative authority under the Rome Statute, actively pursue all relevant evidence from all those who hold it, including all relevant States Parties. Preservation of evidence is not investigation. It is a form of hibernation with the Prosecution essentially functioning as a mailbox only, receiving and saving instead of pursuing and assessing the facts and evidence necessary to identify and prosecute those responsible for heinous crimes."
  },
  {
    "prompt_id": 69,
    "input_text": "The paradigmatic language of Article 17(1) limits OTP authority absent countervailing contextual factors. The formulation that a case is inadmissible unless the domestic state is 'unwilling or unable genuinely' to carry out the investigation or prosecution becomes shorthand for admissibility. OHCHR The Statute preserves the primacy of domestic authority. The textual burden lies with the OTP at the point of initiation to prove that the state investigation is insufficient. This structure preserves state primacy by making deference to good-faith domestic investigations the default response of the Court. If the Prosecutor wants to proceed with the case, she must apply to the Court and affirmatively demonstrate that the state's investigation is inadequate or not authentic."
  },
  {
    "prompt_id": 70,
    "input_text": "The legal construction, which the Office of the Prosecutor appears to be pursuing is a 'one shot' approach to the application of Article 18: Since Israel was already offered an opportunity to request a deferral based on the 2021 investigation, the Prosecutor is not legally required to offer a new opportunity with regard to the extension of the investigation into new armed hostilities. EJIL: Talk! This approach is problematic and not reflective of the significance of Article 18 in the scheme of checks and balances in the ICC Statute. The ordinary meaning of Article 18 suggests that if the Prosecutor wishes to expand the investigation into a new pattern of facts raising new potential charges, he must consider whether to afford a new notification to State parties, informing them on the new contours of the investigation which significantly deviate from the previous investigation. EJIL: Talk! Any other interpretation could render Article 18 devoid of substance in circumstances where the notification was rendered long before the relevant events took place."
  },
  {
    "prompt_id": 71,
    "input_text": "De Guzman's view on complementarity and burden-sharing between the ICC and States Parties can be a blueprint for a system of burden-sharing amongst universal jurisdiction States. I envisage a system of inter-state complementarity and some form of preferential or hierarchical burden-sharing, where universal jurisdiction is exercised by the most appropriate accountability system; the state with the strongest link. Just Security The rationale includes considerations of judicial economy and comity-related concerns, including political or diplomatic considerations. How to determine which State is the designated State? We could use the same principles considered by the ICC in determining its own jurisdiction via a nexus to territory or nationality and in conducting the complementarity analysis, specifically the genuineness of proceedings. The OTP's new approach to complementarity can prompt us to think about a system of universal jurisdiction allocation that calls on the State with the strongest jurisdictional nexus to exercise jurisdiction through a system of coordination and collaboration."
  },
  {
    "prompt_id": 72,
    "input_text": "The principle of complementarity under Article 17 of the Rome Statute distinguishes between two distinct scenarios. The first involves cases of inaction, where no state has initiated domestic proceedings. In such cases, there is no need to examine unwillingness or inability, and the cases are admissible. The second scenario arises when domestic investigations or prosecutions are ongoing and requires the court to determine that the state is unwilling or unable to genuinely carry investigations. Brooklyn Law School While unwillingness is relevant to powerful and less powerful states, it is primarily the latter that might be unable to carry out investigations due to significant deficiencies in their justice system. The principle can lead to beneficial results, but was also criticized as a potential tool of powerful states to avoid accountability for international crimes. This suggests that for powerful states, the design and interpretation of the principle of complementarity play a key role in their potential ability to avoid ICC proceedings through informational gaps and procedural advantages."
  },
  {
    "prompt_id": 73,
    "input_text": "The new Prosecutor wants not only to resolve pending tasks, but also to enter into a more positive cooperative relationship with those States that are fundamentally willing and able to conduct national criminal prosecutions. This breathes new life into the concept known as 'positive complementarity.' Oxford Public International Law The Cooperation Agreement demonstrates the uniqueness of the Colombia approach, which may well have a trailblazing effect. Different narratives and a new strategic direction emerge when the focus shifts from the traditional complementarity analysis under Article 17 to a more collaborative approach. This approach recognizes that complementarity requires not just legal assessment but strategic cooperation between the ICC and national jurisdictions. The Colombia situation serves as an invaluable laboratory of transitional justice, from which important lessons are emerging that can later be replicated elsewhere, representing a fundamental shift in how complementarity operates in practice."
  },
  {
    "prompt_id": 74,
    "input_text": "The ICC has made it clear that a challenge of inadmissibility has to be dealt with in a Two-Step Process. International Center for Transitional Justice Only if you understand how the process works will you understand the right questions to ask about complementarity. The first step consists of two initial questions: whether there are ongoing investigations or prosecutions, or whether there have been investigations in the past and the state having jurisdiction has decided not to prosecute. The second stage relates to unwillingness and inability, which can only be analyzed once the initial questions are answered in the affirmative. International Center for Transitional Justice For example, if the state informs the court that it has already investigated the same case and decided not to prosecute, Article 17 requires verifying the facts by answering: Has there been an investigation into the same case AND did the state decide not to prosecute? If the answer to either part is NO, the ICC case is admissible. This procedural framework ensures systematic analysis of complementarity challenges while protecting both state sovereignty and the Court's ultimate responsibility."
  },
  {
    "prompt_id": 75,
    "input_text": "The complementarity principle was a mere shadow without any flesh and bones whatsoever until the Abdullah Al-Senussi case. The 'awakening hypothesis' of the complementarity principle examines the myth that it was never actually enforced until October 2013. Al-Senussi case arguably is the first instance of the complementarity principle's actual implementation eleven whole years after the ratification of the Rome Statute. This raises fundamental questions about the effectiveness of the complementarity framework during the Court's early years. The principle was largely theoretical rather than practical, operating more as a procedural requirement than a meaningful check on ICC jurisdiction. The analysis of the Al-Senussi judgments reveals how complementarity moved from abstract legal principle to concrete application, demonstrating the challenges inherent in operationalizing complex jurisdictional frameworks. This evolution suggests that complementarity's true function only becomes apparent through sustained jurisprudential development rather than statutory text alone."
  },
  {
    "prompt_id": 76,
    "input_text": "Assessing the proceedings as a whole allows the ICC to look at the facts of a case, which is essential to determine the state's genuineness given that different factual circumstances of each case have an impact on the sentence imposed. Furthermore, a person charged with international crimes may be acquitted, which does not mean the proceedings' non-genuineness. The Expert Group on complementarity held that the complementarity assessment should focus on procedural and institutional factors, rather than on the substantive outcome of national proceedings. This approach recognizes that genuine proceedings can result in acquittals or reduced sentences without indicating unwillingness or inability. The analysis must consider the specific facts of each case as a whole from the moment it started until the Court initiates its admissibility assessment. This holistic approach ensures that complementarity analysis captures the reality of domestic judicial processes rather than focusing narrowly on outcomes that may not reflect the quality of proceedings."
  },
  {
    "prompt_id": 77,
    "input_text": "The ICC seemed to represent a significant advancement in judicial independence. As the principle of complementarity was designed, it creates conditions where all cases may be brought before national courts, whatever the magnitude of the crime, or the status, rank or importance of the accused. The ICC steps in only when such courts do not act, or prove unable or unwilling to do justice. However, it is not enough to claim that the State is 'willing and able' to investigate and prosecute. There must actually be an investigation or prosecution at the national level before the case is even evaluated for its inadmissibility. This requirement ensures that complementarity operates as more than mere political assertion. The complementarity principle represents considerable development even when measured against ad hoc tribunals, but its practical application requires careful attention to the actual rather than claimed willingness of states to pursue genuine proceedings. The challenge lies in distinguishing between procedural compliance and substantive commitment to accountability."
  },
  {
    "prompt_id": 78,
    "input_text": "The International Criminal Court represents the epicenter of growing tension between international criminal justice and state sovereignty. The peculiar ICC admissibility regime under Articles 17 and 19 creates complex procedural challenges that require sophisticated legal analysis. OHCHR The Court's jurisdiction over non-state parties presents particular difficulties when high-ranking officials benefit from immunities under general international law. These jurisdictional questions become especially acute when the Court issues arrest warrants against serving heads of state from non-states parties. The legal reasoning in recent admissibility cases demonstrates how complementarity operates not just as a rule of subsidiarity, but as a mechanism for managing competing claims to jurisdiction. This requires careful balance between respecting state sovereignty and ensuring accountability for the most serious crimes. The evolving jurisprudence shows that complementarity analysis must adapt to different factual and legal circumstances while maintaining principled consistency."
  },
  {
    "prompt_id": 79,
    "input_text": "Under Article 19, the Court has introduced a 'same person/substantially same conduct' test, requiring a great degree of similarity between the domestic investigation and the ICC charges against specific suspects. OHCHR In contrast, Article 18's complementarity criteria tend to be more flexible. They should 'sufficiently mirror the scope of the Prosecutor's intended investigation' but since they are often evaluated before specific charges have been levelled, they are unlikely to involve 'like-for-like' assessments of proceedings. OHCHR They may target the 'same groups or categories of individuals' investigated by the Prosecutor. This distinction between Article 18 and Article 19 complementarity reflects different stages of proceedings and different policy objectives. Article 18 offers States a more realistic timeline to deal with complicated investigations that should start an 'advancing process' within one month but could take time to focus on specific suspects. The more rigid Article 19 standard requires investigation to already focus on specific suspects and crimes, creating different thresholds for complementarity claims."
  },
  {
    "prompt_id": 80,
    "input_text": "The Appeals Chamber in Afghanistan found that Pre-Trial Chambers should not consider admissibility issues when authorizing a proprio motu investigation under Article 15. This effectively means that prior to official opening of a situation, the Prosecutor can bypass complementarity questions. Article 18 offers the first opportunity for States to assert the relevance of their own proceedings, with further opportunities arising through Article 19 challenges once a specific case is opened. OHCHR States should seize the opportunity offered by Article 18 notification when it arises, given the relative flexibility of the mirroring test at this stage. However, not doing so due to lack of political will is not the Prosecutor's problem; the system aims to incentivize States to undertake comprehensive investigations, not just those aligned with their political preferences. This creates a structured approach to complementarity that recognizes different procedural moments and varying degrees of specificity required at each stage. The appellate jurisprudence has clarified that complementarity operates as both a check on prosecutorial power and an incentive for genuine national proceedings."
  },
  {
    "prompt_id": 81,
    "input_text": "While the idea of 'verticality' may be a good approach to provide an understanding of the relationship between judgments of international tribunals and judgments of national tribunals in the case of the Nuremberg and Tokyo Tribunals and of the current ad hoc Tribunals (the ICTY and ICTR), this approach is somewhat misleading when dealing with the ICC as established by the Rome Statute. Unlike Nuremberg and the ICTY and ICTR, the jurisdiction of the permanent ICC will be only complementary to the jurisdiction of national courts and the permanent ICC will have no priority over national proceedings (whether pending or terminated in the form of a final judgment). Wikipedia The design of the ne bis in idem principle in the ICC statute is highly protective of State prosecutions and is expressly different from the statutes for the International Criminal Tribunal for the former Yugoslavia (ICTY) and the International Criminal Tribunal for Rwanda (ICTR) that permit greater control by the international tribunal than exists with the ICC."
  },
  {
    "prompt_id": 82,
    "input_text": "Rule 11bis proceedings of the ICTY and ICTR are good examples of positive complementarity, representing burden sharing between international and domestic criminal justice, and promoting the capacity building of national jurisdictions. Under the International Criminal Tribunal for the former Yugoslavia ('ICTY's') Rule 11bis the principle of classical complementarity enshrined in the Rome Statute is reversed. The Referral Bench of the ICTY tests the adequacy of national systems to determine if cases are transferable to national courts for trial rather than deciding if they are admissible before the Tribunal. This division of labour between the international criminal jurisdiction and national criminal jurisdiction resembles the rationale behind the positive complementarity of the ICC in that it closes the impunity gap created by limited prosecution of only high-level figures while the lower-level perpetrators may be left untouched."
  },
  {
    "prompt_id": 83,
    "input_text": "The ne bis in idem principle is known under a variety of different formulations such as the res judicata rule, autrefois acquit / autrefois convict, and the protection against double jeopardy. Ne bis in idem is a fundamental principle of human rights law and has been recognized by a multitude of international instruments. Michaelgkarnavas Article 14(7) of the ICCPR is unusual amongst other international ne bis in idem provisions. Article 14(7) limits protection to situations where an accused was charged with the same offense, whereas most other international instruments refer to the same acts or conduct. Wikipedia The specific ne bis in idem provision in the Rome Statute is pertinent in this context. While Article 20(1) protects against re-prosecution by the ICC for 'conduct' forming the basis of crimes for which someone has already been acquitted or convicted by the ICC, when it comes to other courts Article 20(2) only protects against re-prosecution for 'a crime referred to in Article 5 for which that person has already been convicted or acquitted' by the ICC."
  },
  {
    "prompt_id": 84,
    "input_text": "El Zeidy argues that the Tribunal's practice has shaped at least three distinct models of complementarity that may stand alongside the current 1998 Rome Statute model. The first model presented is derived from the ICTY's practice of deferring jurisdiction to the national courts on the basis of a division of labour exercised within the framework of the discretionary powers of the Prosecutor. Second, there is the Rule 11bis model which the author compares to the Nuremberg International Military Tribunal strategy and highlights that the Rule reflects a new angle in the understanding of primacy and complementarity. Cambridge Core This does not deny the fact that sending Germans to the 'scene of their crimes' implies that the well established principle of territorial jurisdiction was a legal foundation for the establishment of competence ratione loci."
  },
  {
    "prompt_id": 85,
    "input_text": "Furthermore, different ICTs vary in their approaches and outcomes of sentencing international crimes. For instance, Smeulers, Holá and Van den Berg found that the Special Court for Sierra Leone (SCSL) handed down an average sentence of 38 years and the International Criminal Tribunal for Rwanda (ICTR) of 22.6 years, while the average sentences at International Military Tribunal (IMT), International Military Tribunal for the Far East (IMTFE) and International Criminal Tribunal for the former Yugoslavia (ICTY) were 15–16 years. Therefore, sentences handed out at ICTs vary largely and they are not legally pre-set standards when it comes to their severity. The assessment of adequacy of sentences imposed by domestic jurisdictions needs to be embedded in the particular national context. Such approach, however, needs to be adjusted in cases when penalties for international crimes Oxford Academic are stipulated in laws adopted and implemented in transitional contexts."
  },
  {
    "prompt_id": 86,
    "input_text": "The Appeals Chamber was of the view that the Pre-Trial Chamber did not err in either fact or law when it concluded that Libya had fallen short of substantiating, by means of evidence of a sufficient degree of specificity and probative value, that Libya's investigation covers the same case that is before the Court. To discharge that burden, the State in question must provide the Court with evidence of a sufficient degree of specificity and probative value that demonstrates that it is indeed investigating the case. Furthermore, this was not merely a question of 'investigation' in the abstract, but...whether the same case is being investigated by both the Court and a national jurisdiction. The wording of Article 17(1)(a) must be understood in the context in which it is applied. In other words, Article 17 of the Rome Statute could apply to a number of scenarios on the spectrum, ranging from preliminary rulings regarding admissibility and the Prosecutor's decision to initiate an investigation, to cases which have developed much further."
  },
  {
    "prompt_id": 87,
    "input_text": "Some authors have expressed the view that 'the complementarity test under Article 17 of the ICC Statute applies where the investigation into a given country or conflict situation has yielded a case'. Nevertheless, Article 53(1)(b) of the ICC Statute and Rule 48 of the ICC Rules of Procedure and Evidence appear to request the application of the complementarity test at a much earlier stage of the proceedings. As a result, the question arises as to what is the object of such an admissibility assessment, considering the early stage of the proceedings at which it must be carried out, as well as the fact that a case only arises at a significantly subsequent stage of the proceedings."
  },
  {
    "prompt_id": 88,
    "input_text": "The complementarity principle of the Rome Statute of the International Criminal Court (ICC) is an international legal principle that governs the relationship between two sometimes contrasting international principles of law; namely sovereign equality of States and the international community's duty to end impunity for international core crimes. Article 17 of the Rome Statute envisages that States maintain primary jurisdiction to investigate and prosecute international crimes; while the ICC's jurisdiction to prosecute when States are unwilling or genuinely unable to carry out such investigations or prosecutions constitutes the exception. Building on the evidence in literature, this article elaborates on how complementarity can ideally function in practice in an AU context, thus creating a tension-free relationship between the ICC and national legal systems in Africa."
  },
  {
    "prompt_id": 89,
    "input_text": "The ICC practice has shown a patchy approach that lacks a consistent and clear vision of its relation with domestic jurisdictions. While the ICC has not missed every opportunity to hail its commitment to positive complementarity, the reality is that the Court seems keen on understanding its success through conducting more international prosecutions. The ICC's approach reveals that complementarity operates more as a legal technicality rather than as a genuine deference to national proceedings that are genuinely willing and able to prosecute international crimes."
  },
  {
    "prompt_id": 90,
    "input_text": "Downwards ne bis in idem is foreseen by Article 20(2). This provision establishes an absolute ne bis in idem downwards effect for ICC acquittal or convictions over the crimes referred to in Article 5 of the Statute: genocide, crimes against humanity, war crimes, and aggression, and towards Party States. If downwards ne bis in idem takes into account the same offence in law, upwards ne bis in idem (national court-even from a non-Party State- / towards ICC) is referred to by Article 20(3) of the Rome Statute as 'the same conduct,' i.e., to the historical facts already tried. Reference is not any more to acquittal or conviction but to trial, so other decisions can be taken into account in order to constitute what is a 'bis.'"
  },
  {
    "prompt_id": 91,
    "input_text": "Radical complementarity is defined as 'the idea that as long as a state is making a genuine effort to bring a suspect to justice, the ICC should find his or her case inadmissible regardless of the conduct the state investigates or the prosecutorial strategy the state pursues.' This approach recognizes that states should have the prerogative of deciding which crimes to charge without running the risk that the ICC will minimize the State's choice by prosecuting the same acts under different legal characterizations. The regional complementarity proposed herein sits as an institutional or geographical extension of this approach, recognizing that the ways a state might make a genuine effort to bring a suspect to justice include proceedings before regional tribunals."
  },
  {
    "prompt_id": 92,
    "input_text": "The idea of positive complementarity emerged as a prosecutorial policy of interpreting the principle of complementarity in the Rome Statute. As early as 2003, the OTP clarified that its prosecutorial policy would function with a two-tiered approach to combat impunity. This two-tiered approach consists of focusing on prosecuting those most responsible for crimes at the international level and of encouraging national prosecutions, where possible, for lower-ranking perpetrators. Rule 194 Rules of Procedure and Evidence further provides the procedure relating to reverse cooperation, where the ICC has the decisive power to provide assistance to the requesting authority."
  },
  {
    "prompt_id": 93,
    "input_text": "The author argues that this provision uses 'conduct' to bar ICC trials for acts previously tried domestically and allowed the ICC to assess the genuineness of Libya's domestic trial of Saif Al-Islam Gaddafi. The ICC's evaluation focused on whether Libya's judicial proceedings had resulted in a final decision to the merits, thus acquiring the res judicata effect, and that they were not intended to shield Gaddafi from accountability for crimes against humanity. A pivotal point in this assessment was the lack of finality in regards to the judicial proceedings in the domestic courts, removing the accused from the protection of the ne bis in idem principle. Article 20(3) supports the ICC's complementary jurisdiction by allowing intervention when domestic courts are unwilling or unable to prosecute genuinely."
  },
  {
    "prompt_id": 94,
    "input_text": "In Kenyatta concerns the termination of a case on procedural grounds without a determination of the guilt of the accused regarding the Prosecutor's charges. Such procedural decision is not an acquittal or conviction either formally or in substance and the ne bis in idem in Article 20(1) therefore does not apply. Only if domestic in absentia proceedings amount to a sham trial will they fall under the exception to ne bis in idem envisaged in Article 20(3) (a) and (b) and thereby render the ICC competent to retry the case. The protection offered by human rights conventions does not cease in case of armed conflict or of occupation. The principle ensures that the accused is dealt with accordingly even if the first trial is dismissed. The difference in the wording of the provisions raises concerns on how it undermines the principle's goal of protecting persons from double jeopardy since they could stand to be retried in domestic courts for the same conduct amounting to different crimes recognized by the ICC and the domestic courts."
  },
  {
    "prompt_id": 95,
    "input_text": "The Chamber affirmed that 'there is a strong, growing, universal tendency that grave and systematic human rights violations – which may amount to crimes against humanity by their very nature – are not subject to amnesties or pardons under international law'. The Trial Chamber concluded that the applicability of the Law No. 6 of 2015 to Mr. Gaddafi was incompatible with international law and declared that: 'Granting amnesties and pardons for serious acts such as murder constituting crimes against humanity is incompatible with internationally recognized human rights. Amnesties and pardons intervene with States' positive obligations to investigate, prosecute and punish perpetrators of core crimes. In addition, they deny victims the right to truth, access to justice, and to request reparations where appropriate.'"
  },
  {
    "prompt_id": 96,
    "input_text": "The Appeals Chamber has clarified that although the burden of proof in an admissibility challenge is not explicit in the Statute, 'a State that challenges the admissibility of a case bears the burden of proof to show that the case is inadmissible'. The Court has repeatedly imposed a judicially created requirement that the domestic case must 'sufficiently mirror' the case as developed in the ICC. Thus, judges will first assess the evidentiary basis for finding that the state challenging admissibility has proved that the national investigation or prosecution focused on the 'same person' and 'substantially the same conduct' as framed in the ICC prosecution. If these tests are satisfied the Court must then follow the textual requirements of Article 17 and determine whether the supranational jurisdiction predominates because the domestic capacity is either 'unwilling' or 'unable' to 'genuinely' investigate or prosecute the perpetrator."
  },
  {
    "prompt_id": 97,
    "input_text": "Long-standing OTP strategy focuses on 'high-level perpetrators' who occupy influential organisational positions. However, that preference cannot of itself justify distorting the proper balance of prosecutorial discretion between the ICC and domestic officials. The Appeals Chamber has implicitly undercut current OTP practice because Article 17 does not require the imposition of 'rigid standards primarily based on top seniority' because 'the preventive role of the Court may depend on many factors, much broader than the capacity of an individual to prevent crimes'. Good-faith decisions by experienced prosecutors in accordance with bona fide legal principles bear little resemblance to the picture of indolence in the OTP filing."
  },
  {
    "prompt_id": 98,
    "input_text": "There is debate about whether and to what extent the ne bis in idem principle has transnational application, i.e. whether it would bar a State or an international tribunal from prosecuting a person who had previously been convicted or acquitted in a different State's domestic proceeding. Generally, the ne bis in idem principle is not considered to apply across domestic jurisdictions; the fact that one State has convicted or acquitted a person will not prevent a different State from prosecuting that person for the same crime. Despite the trend in Europe toward recognizing a transnational application of the ne bis in idem principle, lack of transnational application across domestic States has been identified as a 'serious lacuna in international human rights protection,' particularly since States are being encouraged or even obliged to introduce universal jurisdiction for international crimes."
  },
  {
    "prompt_id": 99,
    "input_text": "The two main components of the Completion Strategies aimed at prosecuting as a priority 'the most senior leaders suspected of being most responsible for crimes within the ICTY's jurisdiction and transferring cases involving those who may not bear this level of responsibility to competent national jurisdictions, as appropriate, as well as the strengthening of the capacity of such jurisdictions' before the International Tribunals. This division of labour between the international criminal jurisdiction and national criminal jurisdiction resembles the rationale behind the positive complementarity of the ICC in that it closes the impunity gap created by limited prosecution of only high-level figures while the lower-level perpetrators may be left untouched."
  },
  {
    "prompt_id": 100,
    "input_text": "The OTP has expressed that despite very low range of sentences, it has not found that proceedings violated complementarity norms in the Rome Statute. The Deputy Prosecutor has recognized that penal sanctions may take different forms and achieve their objectives in different ways, including reduced sentences and alternative sentences, as long as they have appropriate sentencing objectives, fulfill certain measures, and are consistent with genuine intent to bring the convicted person to justice. This position clearly recognizes that cases may fall outside the general standard of punishing extraordinary international crimes with retributively proportional prison sentences. The principle of complementarity was designed to respect the principles and values at the core of national criminal justice systems and their penalty regimes, including those systems that are less punitive than the ICC Statute. The modes and severity of punishment in domestic contexts are influenced by normative purposes and interests that a community seeks to protect, especially in transitional contexts where international crimes are committed."
  },
  {
    "prompt_id": 101,
    "input_text": "The ICC issued arrest warrants for Saif Al-Islam Gaddafi and Abdullah Al-Senussi on 27 June 2011 for their alleged criminal responsibility as indirect co-perpetrators on two counts of crimes against humanity – murder under Article 7(1)(a) and persecution under Article 7 (1)(h) of the Rome Statute. Libyan authorities filed challenges to the admissibility of both cases."
  },
  {
    "prompt_id": 102,
    "input_text": "On 31 May 2013, the Pre-Trial Chamber rejected Libya's challenge to the admissibility of the case against Gaddafi and concluded that Libya had fallen short of substantiating, by means of evidence of a sufficient degree of specificity and probative value, that Libya's domestic investigation covered the same case that is before the ICC."
  },
  {
    "prompt_id": 103,
    "input_text": "The Pre-Trial Chamber also found that Libya was genuinely unable to carry out the investigation and prosecution of Gaddafi because of its inability to secure the transfer of Gaddafi into state custody from his place of detention in Zintan, the lack of capacity to obtain necessary testimony, and the inability of judicial and governmental authorities to exercise full control over certain detention facilities and to provide adequate witness protection, as well as significant practical impediments to securing legal representation for Gaddafi."
  },
  {
    "prompt_id": 104,
    "input_text": "On 21 May 2014, the Appeals Chamber rejected Libya's appeal against the Pre-Trial Chamber's decision and confirmed that the Pre-Trial Chamber did not err when it concluded that Libya had not provided enough evidence to demonstrate that it was investigating the same case as the one before the ICC."
  },
  {
    "prompt_id": 105,
    "input_text": "The Appeals Chamber held that to prove a state's unwillingness it must be shown that the proceedings are not conducted independently or impartially, and that they are conducted in a manner inconsistent with the intent to bring the person concerned to justice. The Court clarified that this determination does not involve an assessment of whether the due process rights of a suspect have been breached per se but it recognized that there might be cases where violations of a suspect's rights are so egregious that the proceedings can no longer be regarded as being capable of providing any genuine form of justice to the suspect."
  },
  {
    "prompt_id": 106,
    "input_text": "In considering whether a case is inadmissible under article 17 (1) (a) and (b) of the Statute, the initial questions to ask are (1) whether there are ongoing investigations or prosecutions, or (2) whether there have been investigations in the past, and the State having jurisdiction has decided not to prosecute the person concerned. It is only when the answers to these questions are in the affirmative that one has to look to the second halves of sub-paragraphs (a) and (b) and to examine the question of unwillingness and inability. To do otherwise would be to put the cart before the horse."
  },
  {
    "prompt_id": 107,
    "input_text": "The question of unwillingness or inability does not arise in the present case, because, at the time of the admissibility challenge, there were no domestic investigations or prosecutions against the Appellant; nor did the Congolese authorities, after investigation, decide not to prosecute him. For that reason, the Appeals Chamber sees no need to address the Appellant's arguments under those grounds of appeal."
  },
  {
    "prompt_id": 108,
    "input_text": "The legal issue for the Pre-Trial Chamber's determination was whether the admissibility test in Article 17 of the Rome Statute was met. The Chamber noted there were two limbs to the test: (i) complementarity, as outlined in article 17(1)(a)-(c) of the Rome Statute; and (ii) gravity, as outlined in article 17(1)(d) of the Rome Statute."
  },
  {
    "prompt_id": 109,
    "input_text": "The Pre-Trial Chamber confirmed that the complementarity limb of the admissibility test involves a twofold analysis: (i) establishing whether there are ongoing investigations or prosecutions, or whether there have been investigations in the past, and the State having jurisdiction has decided not to prosecute the person concerned; and afterward, (ii) examining the question of the State's unwillingness and inability to prosecute. By that formulation, the fact of a State's inaction is alone sufficient to render the case admissible."
  },
  {
    "prompt_id": 110,
    "input_text": "The Pre-Trial Chamber rejected this submission noting that the admissibility determination must consider whether the national proceedings relate to the same persons who are subject to the ICC proceedings. The Pre-Trial Chamber confirmed this was consistent with the decision of Pre-Trial Chamber I in Lubanga."
  },
  {
    "prompt_id": 111,
    "input_text": "The Pre-Trial Chamber noted that the Government's insistence on the same conduct cast doubt on the Government's will to actually investigate the three suspects subject to the ICC proceedings. In any event, the Pre-Trial Chamber considered that the material submitted by the Government indicated there were no national investigations against the suspects."
  },
  {
    "prompt_id": 112,
    "input_text": "It is a conditio sine qua non for a case arising from the investigation of a situation to be inadmissible that national proceedings encompass both the person and the conduct which is the subject of the case before the Court."
  },
  {
    "prompt_id": 113,
    "input_text": "Observing that the warrants of arrest issued by the Democratic Republic of the Congo (DRC) against Lubanga contained no reference to his alleged criminal responsibility for the crimes charged in the prosecutor's application, PTC I held that the DRC could not be considered to be acting in relation to the specific case before the court."
  },
  {
    "prompt_id": 114,
    "input_text": "The gravity requirement under article 17(1)(d) is intended to ensure that the Court initiates cases only against the most senior leaders suspected of being the most responsible for the crimes within the jurisdiction of the Court allegedly committed in any given situation under investigation."
  },
  {
    "prompt_id": 115,
    "input_text": "The Appeals Chamber found that there was nothing to indicate that the Trial Chamber erred in its determination that there was no decision not to prosecute within the meaning of Article 17(1)(b) of the Statute. In the view of the Appeals Chamber, the Trial Chamber correctly relied on the judgments of the Court of Appeal of Bangui and the Court of Cassation as indicating prima facie the current status of the judicial proceedings in the case of Etat Centrafricain v. Ange-Félix Patassé."
  },
  {
    "prompt_id": 116,
    "input_text": "If the decision of a State to close an investigation because of the suspect's surrender to the Court were considered to be a 'decision not to prosecute', the peculiar, if not absurd, result would be that because of the surrender of a suspect to the Court, the case would become inadmissible. In such scenario, neither the State nor the ICC would exercise jurisdiction over the alleged crimes, defeating the purpose of the Rome Statute."
  },
  {
    "prompt_id": 117,
    "input_text": "The Appeals Chamber in the Bemba case reasoned that because Bemba did not provide sufficient evidence to demonstrate that the Trial Chamber's decision to reject his Request was an error, and because the Appeals Chamber concluded that the Trial Chamber did not err in deciding that there had not been a decision to prosecute Bemba, the Appeals Chamber did not need to analyze the merits on any other ground of appeal."
  },
  {
    "prompt_id": 118,
    "input_text": "In the case of Gaddafi, the Pre-Trial Chamber drew heavily on its previous decisions in Katanga, Al Bashir, and Lubanga to determine whether the Prosecutor had met its burden. Ultimately, it accepted the Prosecutor's application, finding that there were reasonable grounds to believe that the three men were criminally responsible for one count of murder as a crime against humanity under Article 7(1)(a) of the Rome Statute and one count of persecution as a crime against humanity under Article 7(1)(h)."
  },
  {
    "prompt_id": 119,
    "input_text": "The Pre-Trial Chamber decided not to exercise its discretion pursuant to Article 19(1) to determine, proprio motu, the admissibility of the case in accordance with Article 17. Whilst it did not expressly state so, the Pre-Trial Chamber appeared to acknowledge that it would be inappropriate to determine admissibility in circumstances where the arrest warrant application was being conducted on an ex parte basis."
  },
  {
    "prompt_id": 120,
    "input_text": "In comparison to the cases above, in which the ICC was required to analyze the admissibility of the case under Article 17, the ex parte nature of a warrant request resulting from a Security Council referral appears to hold the Chambers to a lower standard of complementarity."
  },
  {
    "prompt_id": 121,
    "input_text": "Curiously, an analysis at the Pre-Trial level in Gaddafi like the one that took place in Kosgey (referred on the Prosecutor's motion) may have very well revealed diligent proceedings on the part of the Libyan domestic courts, at least applying the same criteria set out in Kosgey. Nevertheless, the method by which Gaddafi was referred (Security Council unanimous referral) triggered criteria concerning the question of complementarity."
  },
  {
    "prompt_id": 122,
    "input_text": "The Court has decided that Gaddafi must be tried by the ICC, but Al-Senussi may be tried in Libya. In assessing the ICC's different reasoning in these cases, three main differences were identified. First, the two cases were factually different. Whereas the allegations against Gaddafi had a broad geographical and temporal scope, spanning events occurring across the country including in Tripoli, Benghazi, Derna and Tobruk, the case against Al-Senussi concerned conduct only occurring during the repression of demonstrations in Benghazi."
  },
  {
    "prompt_id": 123,
    "input_text": "The Appeals Chamber determined that although Libya had demonstrated its capacity to collect sufficient evidence in Al-Senussi, the same could not be said in the Gaddafi case. Secondly, the Appeals Chamber confirmed the Pre-Trial Chamber's approach to the issue of whether Libya could exercise control over the two accused."
  },
  {
    "prompt_id": 124,
    "input_text": "At the time of the admissibility proceedings, Saif Gaddafi was in the custody of a local militia in Zintan. Al-Senussi, on the other hand, was held in an ostensibly government-controlled detention facility in Tripoli. The fact that the Libyan government could not effect Saif Gaddafi's transfer and did not have control over the militia holding him was determinative in both Chambers' reasoning."
  },
  {
    "prompt_id": 125,
    "input_text": "The third major difference explaining the divergent decisions was the position taken by the ICC Prosecutor in relation to the admissibility challenges. In Al-Senussi, the Prosecutor supported Libya's argument in favour of national prosecution. In Gaddafi, however, the Prosecutor opposed Libya's challenge. The speakers agreed that the Prosecutor's position in each case can go a long way in explaining the different outcomes and raises broader questions of the proper role of the prosecutor in admissibility challenges before the ICC."
  },
  {
    "prompt_id": 126,
    "input_text": "The Government of Kenya respectfully requests the Pre-Trial Chamber to determine that both of these cases are inadmissible before the ICC in accordance with Article 17 and Article 19 of the Statute. Kenya has acted with full respect for the provisions of Article 19(5). The recent and current initiatives have all been designed and adopted to cure problems, or shortcomings, of the past. They demonstrate that the time is ripe for Kenya to exercise jurisdiction which the ICC should yield. In so doing both the ICC and Kenya will uphold, and remain faithful to, the cornerstone principle of the ICC, that of the ICC's jurisdiction being complementary to national criminal jurisdictions. The ICC does not enjoy primacy over Kenya's domestic jurisdiction."
  },
  {
    "prompt_id": 127,
    "input_text": "This Application is the first to be made under Article 19 by any State before the ICC. There is, thus, no ICC case law directly on point. The limited jurisprudence from cases in which admissibility has been considered in other circumstances indicates that the admissibility of a case should be determined on the basis of the facts as they exist at the time of the proceedings concerning the admissibility challenge. The Court should consider whether there is any record of investigations or prosecutions at the time of the proceedings. The relevant period is thus when the application is being considered and determined as a whole and not merely the date on which the application is first filed, which would be artificial in the extreme."
  },
  {
    "prompt_id": 128,
    "input_text": "The Chamber examined the three requests put forth by the Kenyan Government and considers that in order to be in a position to rule on the merits of the First Request related to the inadmissibility of the case, it must initially address the Second and the Third Requests, which mainly relate to the organization of the proceedings concerning the article 19 challenge. Given the language used in rule 58 of the Rules, the Chamber is bestowed with the necessary discretion to organize the proceedings related to an admissibility challenge in manner that best suits the circumstances of each particular case. This is clear from the reference to the phrase shall decide on the procedure to be followed and the discretion provided by using the verb may take appropriate measures and may hold a hearing."
  },
  {
    "prompt_id": 129,
    "input_text": "The Pre-Trial Chamber held that the evidence submitted in support of the admissibility application established that concrete and progressive steps had been taken in the national investigation in relation to substantially the same conduct as alleged in the proceedings before the Court. It further held that Libya was not unwilling to genuinely carry out the investigation or prosecution. It concluded that there was no indication that national proceedings were being conducted for the purpose of shielding Mr Al‑Senussi, proceedings were not tainted by unjustified delay, and the investigations were not being conducted in a manner inconsistent with the intent to bring Mr Al‑Senussi to justice. Further, it held that Libya was not unable to prosecute the case."
  },
  {
    "prompt_id": 130,
    "input_text": "Mr Al‑Senussi first submits that the implementation of the Impugned Decision namely that Libya proceeds to try and sentence Mr Al‑Senussi, as opposed to him being transferred and tried at the ICC would defeat the purpose of the appeal, which is to determine whether Mr Al‑Senussi can be tried in Libya at all, and is centred on the application of Article 17(1)(a) as opposed to article 17(1)(c), also in light of the pace of ongoing relevant domestic proceedings. Second, Mr Al‑Senussi argues that implementing the Impugned Decision would create an irreversible situation and consequences that could not be corrected, since any domestic trial in Libya would inevitably result in the imposition of the death penalty."
  },
  {
    "prompt_id": 131,
    "input_text": "Although the International Criminal Court (ICC) has recently expanded its reach — investigating powerful states such as the United States and Russia — it has yet to prosecute anyone from a powerful state. The principle of complementarity under Article 17 states a case is inadmissible before the ICC unless the State is unwilling or unable to genuinely carry out investigations. The ICC distinguishes cases of inaction from those with ongoing domestic proceedings, requiring the ICC to determine the state's unwillingness or inability."
  },
  {
    "prompt_id": 132,
    "input_text": "The ICC operates as a court of 'last resort', deferring to national jurisdictions unless they are unwilling or unable to prosecute international crimes. This principle incentivizes states to take ownership of prosecuting serious crimes autonomously, respecting sovereignty and the corresponding jurisdictional prerogatives."
  },
  {
    "prompt_id": 133,
    "input_text": "The analysis of complementarity involves a two-step process: first, whether national authorities have investigated or prosecuted the same case; second, if so, whether the state is unwilling or unable genuinely to conduct proceedings. The ICC's judiciary examines admissibility challenges strictly based on these criteria, with judicial reasoning emphasizing the necessity that the same person and the same conduct are involved for admissibility to be denied."
  },
  {
    "prompt_id": 134,
    "input_text": "Powerful states, such as the United Kingdom and Israel, have used the principle of complementarity through substantial legal resource investment to shield themselves from ICC proceedings, despite limited substantive accountability. This dynamic raises concerns about fairness and selectivity in ICC prosecutions, as less powerful states are more vulnerable to ICC scrutiny."
  },
  {
    "prompt_id": 135,
    "input_text": "Critics argue that the ICC's Office of the Prosecutor often defers excessively to domestic investigations by powerful states despite lack of transparency and meaningful prosecutions. The Iraq/UK case exemplifies this issue where 10 years of investigations yielded few convictions, but the ICC closed its preliminary examination citing complementarity. The informational gap limited thorough ICC scrutiny, potentially allowing avoidance of accountability."
  },
  {
    "prompt_id": 136,
    "input_text": "The Rome Statute introduced an innovative approach to international criminal jurisdiction through the complementarity principle, requiring the ICC to defer to genuine national proceedings. Scholarship highlights that complementarity places the burden on the ICC to assess whether domestic investigations encompass both the persons and conduct alleged, and only intervenes where there is clear evidence of inability or unwillingness. This balance is meant to safeguard state sovereignty while ensuring accountability for international crimes."
  },
  {
    "prompt_id": 137,
    "input_text": "Complementarity is not just a technical admissibility criterion; it is grounded in respect for national legal systems as the primary locus of justice for atrocity crimes. Academic commentaries emphasize that the ICC’s admissibility assessment, particularly under Article 17, must determine if a state’s proceedings are authentic, impartial, and comprehensive. The process involves a factual inquiry into whether national authorities have taken concrete steps to investigate or prosecute, with judicial review scrutinizing the purpose and effectiveness of these actions."
  },
  {
    "prompt_id": 138,
    "input_text": "Legal scholars note that the ICC’s articulation of complementarity has evolved through practical application: mere formal investigations are insufficient to render a case inadmissible. The Court requires evidence of active, substantial, and specific domestic proceedings—mere claims of investigation do not suffice. The literature further points to the Court's skepticism toward perfunctory domestic efforts, stressing that shielding suspects from genuine accountability violates the Statute’s object and purpose."
  },
  {
    "prompt_id": 139,
    "input_text": "An analysis in international law journals highlights how defense teams challenge ICC jurisdiction based on complementarity. Thorough admissibility challenges often involve expert testimony and forensic examination of national prosecutorial records, aiming to demonstrate real investigative or judicial action covering the same alleged conduct. Scholarly reviews detail that such challenges subject the ICC’s case to rigorous evidentiary scrutiny and test the boundaries of sovereignty, fairness, and procedural justice."
  },
  {
    "prompt_id": 140,
    "input_text": "The evolving literature in transitional justice and international criminal law argues that complementarity is both a legal and policy tool: it encourages positive national reforms and capacity-building for complex crimes. Scholars caution, though, that uneven implementation and political pressure can compromise the objectivity of the complementarity process."
  },
  {
    "prompt_id": 141,
    "input_text": "The legal criteria for situation and case selection, provided in the Rome Statute and related regulations, are relatively open as to allow the Prosecutor a considerable degree of discretion. In order to guide this discretion, the Office of the Prosecutor has developed certain policies and strategies. Prosecutorial policy and strategy stands, almost by definition, at a crossroads between law and politics. This Article identifies strategic choices of the OTP in situation and case selection and analyzes them in relation to the ICC’s objectives. There are tensions between the need for predictability and legal certainty on the one hand and for pragmatism and case-by-case flexibility on the other hand. The Article finds that the OTP is downplaying its own discretion by emphasizing the legalistic and apolitical character of its decision-making and bringing the objectives of ending impunity, preventing crimes, and providing redress to victims to the fore."
  },
  {
    "prompt_id": 142,
    "input_text": "According to existing approaches to complementarity, lenient sentences have been traditionally seen as indicative of ungenuine procedures aimed to subtract a person from criminal responsibility. Nevertheless, their existence in transitional contexts responds to other legitimate interests derived from the goals of transition and are imposed after properly conducted procedures and investigations, thus consistent with a genuine attempt to bring a person to justice. Therefore, a new definition of genuineness is required considering the importance of this element as qualifying characteristic of domestic proceedings when assessing admissibility. This paper considers that such definition could be developed departing from the purposes of sentencing of the Rome Statute, thus a purpose-based approach is proposed."
  },
  {
    "prompt_id": 143,
    "input_text": "Interpreting complementarity, gravity and interest of justice requirements remain inexplicable due to the difficulties in navigating between legal and political considerations. Generally, concerns of inconsistency and selectivity have been raised pointing towards the broad discretion enjoyed by the ICC prosecutor. The Rome Statute borrowed significantly from the ad hoc tribunals. It assigns to the Office of the Prosecutor (OTP) the duty of receiving referrals and any substantiated information on crimes within the Court's jurisdiction. The Statute tasks the Prosecutor with conducting investigations and prosecutions before the Court. The Prosecutor is however not under any obligation to initiate proceedings once a situation has been referred to the OTP. The Statute uses the word may as opposed to shall, removing any obligations and depicting broad discretion."
  },
  {
    "prompt_id": 144,
    "input_text": "There are distinct features in the ICC when compared to the ad hoc tribunals. The International Criminal Court is a permanent treaty with express jurisdiction on serious crimes of international concern. Although the ICC is treaty based, it can have jurisdiction over non-party states through a Security Council referral, a mandate closely tied with the UN powers to maintain peace and security under chapter seven of the UN Charter. Secondly, the ICC is complementary to national criminal institutions, instead of having supremacy over them. Thirdly, the ICC prosecutor can initiate investigations on his own motion (proprio motu) into situations but subject to Pre Trial Chamber (PTC) authorization."
  },
  {
    "prompt_id": 145,
    "input_text": "Closely related to admissibility is the complementarity principle whereby national courts are given precedence to prosecute international crimes. This principle remains the cornerstone of the Rome Statute as it upholds the long standing principle of state sovereignty. It also informally acts as a check to prosecutorial discretion since it requires the Prosecutor to defer cases to the national jurisdictions unless the affected state is unwilling or unable to genuinely prosecute. This topic remains unsettled among scholars."
  },
  {
    "prompt_id": 146,
    "input_text": "Complementarity remains difficult to assess particularly when the ICC prosecutor is exercising proprio motu powers. While at the time an investigation is requested, the Prosecutor might not have identified the potential suspects. Nevertheless, the Pre Trial Chamber is required to give a determination on admissibility in which complementarity and gravity under Article 53 (1) are key factors. It is not clear whether prospective investigations or promises to investigate and conduct prosecutions can bar admissibility. Furthermore, it appears that the ICC will only accept prosecutions and steps such as traditional justice measures and fact finding commissions cannot pass as genuine investigations or prosecutions."
  },
  {
    "prompt_id": 147,
    "input_text": "There is also an emerging concept pertaining to complementarity termed as positive complementarity or what William Burke calls proactive complementarity, a mechanism adopted by the Office of the Prosecutor to encourage national jurisdictions to conduct genuine national proceedings. In essence, under this new principle, the OTP will attempt to take positive measures to ensure that national courts prosecute crimes rather than compete with them for jurisdiction. This mechanism has received mixed reaction among scholars."
  },
  {
    "prompt_id": 148,
    "input_text": "Many scholars concur that evaluating or construing the gravity criterion both as a requirement of the admissibility assessment under Article 53(1) and as articulated in Article 17(1) (d) remains mysterious as far as the OTP is concerned. This problem is compounded by lack of clear judicial pronouncements and legal commentary concerning the subject. It is important to note that apart from complementarity, a case may be inadmissible due to insufficient gravity. The word sufficient is vague as it lacks the basic minimum and maximum and is very subjective."
  },
  {
    "prompt_id": 149,
    "input_text": "Just like Nuremberg and the ad hoc tribunals, the ICC has received criticism of being selective. This may present itself generally in ICC choice of situations, choice of cases or charges. Although the Prosecutor has indicated that his duty is simply judicial and non-political, his interpretations of the legal requirement leave so much to be desired. The ICC is faced with a challenge of balancing between legal and policy considerations. Also there are challenges of selectivity and this might affect the legitimacy of the Court."
  },
  {
    "prompt_id": 150,
    "input_text": "The way Kenyan cases were handled are a replica of unchecked powers of the prosecutor. As a way forward, the ICC should employ positive complementarity when handling cases as a way of winning support from national prosecutions."
  },
  {
    "prompt_id": 151,
    "input_text": "The jurisdictional framework of the Rome Statute is clear: A State must be a State Party at the time of the exercise of jurisdiction."
  },
  {
    "prompt_id": 152,
    "input_text": "The correct moment to determine when the Court 'has' jurisdiction stricto sensu is, thus, only at that point in time when the alleged crimes were committed."
  },
  {
    "prompt_id": 153,
    "input_text": "The true issue in the present instance is whether 'dormant jurisdiction' stricto sensu could be triggered and whether the Court could properly exercise jurisdiction after the Philippines' effective withdrawal from the Rome Statute."
  },
  {
    "prompt_id": 154,
    "input_text": "The capacity to exercise jurisdiction, as distinct from the existence of jurisdiction, is predicated on the fulfilment of the conditions set out in Article 12(2)."
  },
  {
    "prompt_id": 155,
    "input_text": "As jurisdictional 'preconditions', they must be assessed, as the language suggests, at the moment the Court is considering whether to exercise its jurisdiction."
  },
  {
    "prompt_id": 156,
    "input_text": "Textually, this indicates that a State must be a party to the Rome Statute contemporaneously with the Court's decision to exercise jurisdiction."
  },
  {
    "prompt_id": 157,
    "input_text": "Determination of whether the conduct was committed on the territory of a State Party or could be attributed to a national of a State Party happens at the time the decision is made to exercise jurisdiction, not at the time of the commission of the crime."
  },
  {
    "prompt_id": 158,
    "input_text": "This Pre-Trial Chamber only issued its decision to authorise an investigation on 15 September 2021, thus triggering the 'initiation of an investigation' when the Philippines was no longer a State Party."
  },
  {
    "prompt_id": 159,
    "input_text": "Once the State's withdrawal has become effective, the Prosecutor can no longer open an investigation."
  },
  {
    "prompt_id": 160,
    "input_text": "No interpretation of Article 127(2) can trump the plain language of Article 12(2), which requires that, as a 'pre-condition to the exercise of jurisdiction', a State be contemporaneously a party to the Rome Statute."
  },
  {
    "prompt_id": 161,
    "input_text": "The simple fact is that the Republic of the Philippines was not a party to the Rome Statute in 2021."
  },
  {
    "prompt_id": 162,
    "input_text": "The expression 'under consideration by the Court' only appears one other time in the Rome Statute. In the context of an admissibility challenge under Article 95, the expression 'under consideration by the Court' refers, clearly and unequivocally, to the judiciary."
  },
  {
    "prompt_id": 163,
    "input_text": "A preliminary examination is not a formal procedural phase defined in the Rome Statute, but is, rather, a catch-all phrase designed to cover internal deliberations within the Office of the Prosecutor and a possible decision, at some future point in time, to open a formal investigation."
  },
  {
    "prompt_id": 164,
    "input_text": "It is unreasonable to interpret the Rome Statute as permitting an internal decision by the OTP to take an interest in a Situation as sufficient to trump a State's sovereign decision to withdraw from the Rome Statute."
  },
  {
    "prompt_id": 165,
    "input_text": "Even if a 'preliminary examination' were, arguendo, considered to be a 'matter under consideration' by the Court, this has no bearing on whether the Court was allowed to exercise jurisdiction under Article 12, which is a different 'matter' entirely."
  },
  {
    "prompt_id": 166,
    "input_text": "It is not a condition of making an admissibility challenge that [the suspect] must surrender himself to the Court and no such requirement is expressly or impliedly contained in Article 19."
  },
  {
    "prompt_id": 167,
    "input_text": "The ordinary meaning of 'has been tried by another court' is that court proceedings in relation to the relevant person have been instigated by national authorities and have concluded with a verdict convicting or acquitting that person."
  },
  {
    "prompt_id": 168,
    "input_text": "The Trial Chamber correctly identified that the defining characteristic of a concluded trial is the existence of a decision on the merits."
  },
  {
    "prompt_id": 169,
    "input_text": "Article 20(3) of the Statute is triggered once a decision on conviction or acquittal by a trial court is rendered."
  },
  {
    "prompt_id": 170,
    "input_text": "Even if Dr. Gadafi had a hypothetical right to ask for a re-trial because the judgment was pronounced in absentia, Law No. 6 of 2015 takes away that possibility and so renders the existing Judgment final (subject only to the possible re-opening of proceedings should Dr. Gadafi commit a further offence within the relevant five year period)."
  },
  {
    "prompt_id": 171,
    "input_text": "It cannot be right that this case remains admissible at this Court because there remains a hypothetical possibility of the re-opening of proceedings in Libya in the event of future re-offending."
  },
  {
    "prompt_id": 172,
    "input_text": "The Admissibility Challenge should be judged on the current position; the current position is that national proceedings against Dr. Gadafi have been concluded with judgment on the merits."
  },
  {
    "prompt_id": 173,
    "input_text": "there is no requirement that conduct be prosecuted as an international crime and asserts that conduct forming the basis for crimes under the Statute may be prosecuted as 'ordinary crimes' under national law"
  },
  {
    "prompt_id": 174,
    "input_text": "account must be taken of other national laws, such as discrepancies in the modes of liability, defences, or grounds for excluding criminal responsibility which might impact on or impede domestic prosecutions"
  },
  {
    "prompt_id": 175,
    "input_text": "while the conduct charged, meaning the acts and incidents, must be the same in the case before the Court and the national proceedings, the legal characterisation of the acts may differ"
  },
  {
    "prompt_id": 176,
    "input_text": "'substantially the same conduct' cannot be interpreted in a manner that would allow variation in the underlying facts and incidents, as such a flexible interpretation would undermine the very purpose of complementarity"
  },
  {
    "prompt_id": 177,
    "input_text": "the Chamber should satisfy itself that, at a minimum, 'the national authorities are focused on the same course of conduct and series of events as the ICC, meaning that they are examining the person's criminal responsibility in the context of substantially the same incidents and underlying facts and allegations of criminal responsibility'"
  },
  {
    "prompt_id": 178,
    "input_text": "the Chamber should consider 'whether the conduct that forms the basis of the ICC crimes - for which the Court seeks the person's surrender - is reflected in the crimes for which the suspect stands accused at the national level'"
  },
  {
    "prompt_id": 179,
    "input_text": "The Prosecutor submits that the second limb of the test requires Libya to demonstrate that its proceedings are not a sham designed to shield the person and guarantee impunity and that it is able to advance the investigation and prosecution within the meaning of article 17(3) of the Statute."
  },
  {
    "prompt_id": 180,
    "input_text": "The Prosecutor contends that there is no requirement on the State to demonstrate that its domestic procedures and protections are consistent with those of other legal systems, including those of the Court, and relies on the opinion of commentators and the drafting history of the Statute as supporting this view."
  }
]